wlbxcj/STM32P10/3911版/src/driver/smartcard/emv_hard.c
/**
 * =============================================================================
 * 文档主要实现STM32F10x系列智能卡读卡器功能，与硬件紧密关联的部分。开发驱动时请
 * 参考"emv_hard.h"中的接口声明，实现其接口可快速移植协议。
 *
 * Author            : lian guang ping
 * Date              : 2012-4-24
 * Hardware platform : v10p
 * Email             : lian98@163.com
 * =============================================================================
 */


#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>
#include <ctype.h> 
#if 0
#include "icc.h"
#include "base.h"
#include "vosapi.h"
#endif
//#include "usip.h"
#include "KF701DH.h"

#include "..\..\inc\FunctionList.h"

#include  "base.h"
#include  "icc.h"
#include  "vosapi.h"






#if 0
#include "emv_errno.h"
#include "emv_hard.h"
#include "emv_queue.h"
#include "emv_patch.h"
#include "emv_core.h"

#include "stm32f10x_type.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_nvic.h"
#include "stm32f10x_it.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_tim.h"
#include "stm32f10x_usart.h"

#include "kf323_emv_hard.h"

static volatile struct emv_core  *scs_dev = NULL; /*当前设备句柄*/
volatile struct emv_queue      	  scs_queue[ 2 ]; 
static volatile int               repeat_chc = 0; /*错误重发次数*/
static volatile int               scs_stat;       /**/
#define SC_UART_WAIT_TS          ( 1 << 0 )
#define SC_UART_RECV_EV          ( 1 << 1 )
#define SC_UART_SEND_EV          ( 1 << 2 )

static volatile int               work_step;    /*卡片复位阶段标记*/ 
#define SC_UART_WAIT_EVENT       ( 1 << 2 )
#define SC_UART_CLKS_EVENT       ( 1 << 3 )
#define SC_UART_RSTL_EVENT       ( 1 << 4 )
#define SC_UART_RSTH_EVENT       ( 1 << 5 )
#define SC_UART_IGDT_EVENT       ( 1 << 6 )

static volatile unsigned int       scs_rwt;     /* 有效复位等待时间 */ 
static volatile unsigned int       scs_etu;     
static volatile int                wait_counter;/* 等待计数器 */ 
volatile unsigned int              scs_bwt;     /* 块等待时间和'TS'等待时间 */ 
volatile unsigned int              scs_cwt;     /* T=1 CWT and T=0 WWT */ 
volatile unsigned int              scs_cgt;

volatile unsigned int              scs_crg = 0; /* 虚拟控制寄存器 */
#define CONV_EN                  ( 1 << 0 )     /* 通信逻辑 */ 
#define CRPT_EN                  ( 1 << 1 )     /* 错误重发/收标记 */
#define TTSC_EN                  ( 1 << 2 )     /* TS字符是否已经收到 */         
#define PARC_B                   ( 1 << 3 )     /* 偶校验位 */
#define PARE_SB                  ( 1 << 4 )     /* 校验错误标记 */

volatile int                       twt_state;       /*超时标记*/
volatile int                       twt_wait_counter;/*超时计数器*/
#define TWT_READY  			       0
#define TWT_START  			       1
#define TWT_STOP   			       2

/*标记SAM卡共用电源和时钟信号*/
static unsigned int                sam_vcc_used_flag = 0;
static unsigned int                sam_clk_used_flag = 0;
static unsigned int                sam_slot_last_flag = 0;

/*本地全局函数区*/
static int  USART_TOV_Timer( int enable, int etu );          /*超时定时器控制*/
static void Timer5_Isr( void );
static void Usart1_Isr( void );
static void Usart2_Isr( void );
static unsigned char scs_inverse_ch( unsigned char c );
static int  emv_hard_config( struct emv_core *pdev );        /*工作参数配置*/
static int  emv_hard_power_signal( int channel, int vcc );   /*电源控制信号控制*/
static int  emv_hard_clock_enable( int channel, int enable );/*时钟控制信号控制*/
static int  emv_hard_reset_signal( int channel, int level ); /*卡片复位信号控制*/

/**
 * 清智能卡控制器1中断
 */
static void USART1_ISR_Clr()
{
	unsigned char ch;

	ch = SC_SML_UART->SR;
	ch = SC_SML_UART->DR;
	
    ch = ch;
    
	return;
}

/**
 * 清智能卡控制器2中断
 */
static void USART2_ISR_Clr()
{
	unsigned char ch;

	ch = SC_BIG_UART->SR;
	ch = SC_BIG_UART->DR;
	
    ch = ch;

	return;
}

/**
 * 智能卡波特率配置
 */
static void USART_SmartCardSetBrr( int brr )
{
	unsigned int tmpreg            = 0x00; 
	unsigned int apbclock          = 0x00;
	unsigned int integerdivider    = 0x00;
	unsigned int fractionaldivider = 0x00;

    if( NULL == scs_dev )return;
    
    if( brr > 40000 )brr -= 12;/*补偿边沿损失*/
    else brr -= 2; 
    
	if( USC == scs_dev->terminal_ch )apbclock = 72000000ul / 2;
	else apbclock = 72000000ul;
	
	/* Determine the integer part Bug: CR1_OVER8_Set (used in original code, removed now) is undocumented.*/
	integerdivider = ( 25ul * apbclock ) / ( 4 * brr );
	tmpreg = ( integerdivider / 100 ) << 4;
	fractionaldivider = integerdivider - ( 100 * ( tmpreg >> 4 ) ); //Determine the fractional part 
	tmpreg |= ( ( ( fractionaldivider * 16 ) + 50 ) / 100 ) & ( (unsigned char)0x0F );
	
	if( USC == scs_dev->terminal_ch )SC_BIG_UART->BRR = ( unsigned short )tmpreg;
	else SC_SML_UART->BRR = ( unsigned short )tmpreg;	
	
	//dbg_msg( 1, "BRR = %X\r\n", tmpreg );
	
	return;
}

/**
 * 智能卡控制器1配置
 */
static void USART1_Config( )
{
	GPIO_InitTypeDef       GPIO_InitStructure;
	USART_InitTypeDef      USART_InitStructure;
	NVIC_InitTypeDef       NVIC_InitStructure;
	
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_USART1, ENABLE );				   

	//AFIO->MAPR &= ~( 1 << 2 );
	
	NVIC_InitStructure.NVIC_IRQChannel                  = USART1_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority       = 1;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority= 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd               = ENABLE;
	NVIC_Init( &NVIC_InitStructure );	
   
	GPIO_InitStructure.GPIO_Pin   = SAM_CLK_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_Init( SAM_GPIO_PORT_1, &GPIO_InitStructure );

	GPIO_InitStructure.GPIO_Pin   = SAM_IO_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;
	GPIO_Init( SAM_GPIO_PORT_1, &GPIO_InitStructure );		

	USART_SetPrescaler( SC_SML_UART, 0x0A );// USART Clock 3.6MHz
	USART_SetGuardTime( SC_SML_UART, 0x12 );// USART Guard Time 12 Bit 

	USART_InitStructure.USART_Clock      = USART_Clock_Disable;
	USART_InitStructure.USART_CPOL       = USART_CPOL_Low;
	USART_InitStructure.USART_CPHA       = USART_CPHA_1Edge;
	USART_InitStructure.USART_LastBit    = USART_LastBit_Enable;
	USART_InitStructure.USART_BaudRate   = FCLK_CARD / 372;
	USART_InitStructure.USART_WordLength = USART_WordLength_9b;
	USART_InitStructure.USART_StopBits   = USART_StopBits_1_5;
	USART_InitStructure.USART_Mode 	     = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_Parity     = USART_Parity_No;	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_Init( SC_SML_UART, &USART_InitStructure ); 
        Set_IRQProcessFunc( USART1_IRQChannel, Usart1_Isr );
        
	USART_ITConfig( SC_SML_UART, USART_IT_IDLE, DISABLE ); 
	USART_ITConfig( SC_SML_UART, USART_IT_TXE, DISABLE ); 
	USART_ITConfig( SC_SML_UART, USART_IT_RXNE, DISABLE ); 
	USART_ITConfig( SC_SML_UART, USART_IT_TC, DISABLE ); 
	USART_ITConfig( SC_SML_UART, USART_IT_FE, DISABLE ); 
	USART_ITConfig( SC_SML_UART, USART_IT_PE, DISABLE ); 

	USART_Cmd( SC_SML_UART, ENABLE );                  // Enable SC_BIG_UART
	USART_SmartCardNACKCmd( SC_SML_UART, DISABLE ); // Enable the NACK Transmission */ 	
	USART_SmartCardCmd( SC_SML_UART, ENABLE );      // Enable the Smartcard Interface */
	
        Set_IRQProcessFunc( USART1_IRQChannel, Usart1_Isr );
        
	return;
}

/**
 * 智能卡控制器2配置
 */
static void USART2_Config( )
{
	GPIO_InitTypeDef       GPIO_InitStructure;
	USART_InitTypeDef      USART_InitStructure;
	NVIC_InitTypeDef       NVIC_InitStructure;
	
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_USART2, ENABLE );  // enable usart2 clock				   

	//AFIO->MAPR &= ~(1 << 3); 				 // no remap
	
	NVIC_InitStructure.NVIC_IRQChannel                  = USART2_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority       = 1;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority= 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd               = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
   
	GPIO_InitStructure.GPIO_Pin   = ICC_CLK_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_Init( ICC_GPIO_PORT_1, &GPIO_InitStructure );
  
