wlbxcj/STM32P10/3911版/src/driver/smartcard/emv_hard.c
	GPIO_InitStructure.GPIO_Pin   = ICC_IO_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;
	GPIO_Init( ICC_GPIO_PORT_1, &GPIO_InitStructure );		
	
	USART_SetPrescaler( SC_BIG_UART, 0x05 );// USART Clock 3.6MHz
	USART_SetGuardTime( SC_BIG_UART, 0x12 );// USART Guard Time 12 Bit 
  
	USART_InitStructure.USART_Clock      = USART_Clock_Disable;
	USART_InitStructure.USART_CPOL       = USART_CPOL_Low;
	USART_InitStructure.USART_CPHA       = USART_CPHA_1Edge;
	USART_InitStructure.USART_LastBit    = USART_LastBit_Enable;
	USART_InitStructure.USART_BaudRate   = FCLK_CARD / 372;
	USART_InitStructure.USART_WordLength = USART_WordLength_9b;
	USART_InitStructure.USART_StopBits   = USART_StopBits_1_5;
	USART_InitStructure.USART_Mode 	     = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_Parity     = USART_Parity_No;	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_Init( SC_BIG_UART, &USART_InitStructure );
	
	USART_ITConfig( SC_BIG_UART, USART_IT_IDLE, DISABLE ); 
	USART_ITConfig( SC_BIG_UART, USART_IT_TXE, DISABLE ); 
	USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, DISABLE ); 
	USART_ITConfig( SC_BIG_UART, USART_IT_TC, DISABLE ); 
	USART_ITConfig( SC_BIG_UART, USART_IT_FE, DISABLE ); 
	USART_ITConfig( SC_BIG_UART, USART_IT_PE, DISABLE ); 

	USART_Cmd( SC_BIG_UART, ENABLE );                  // Enable SC_BIG_UART
	USART_SmartCardNACKCmd( SC_BIG_UART, DISABLE ); // Enable the NACK Transmission */ 	
	USART_SmartCardCmd( SC_BIG_UART, ENABLE );      // Enable the Smartcard Interface */
	
        Set_IRQProcessFunc( USART2_IRQChannel, Usart2_Isr );
        
	return;
}

/**
 * 智能卡控制器1的中断服务函数
 */
void Usart1_Isr()
{
    unsigned char ch         = 0;	
	int           parity_bit = 0;
    
	if( TWT_READY == twt_state ) // to start atr-wwt counter
	{
		twt_state = TWT_START;
	}
	
	if( SC_UART_RECV_EV & scs_stat )
	{ 	    		
		if( SC_SML_UART->SR & ( 1 << 5 ) )
		{   
			wait_counter       =   scs_cwt;
			work_step          =   SC_UART_WAIT_EVENT;

			if( scs_stat & SC_UART_WAIT_TS ) // TS character 
			{    
				parity_bit = SC_SML_UART->DR;	
				if( 0x0103 == parity_bit )
				{         
					ch        =  0x3F;
					scs_crg  |=  CONV_EN;					
					SC_SML_UART->CR1 |= 1 << 10;    // parity enable
					SC_SML_UART->CR1 |= 1 << 9;    //odd parity
				}
				else if( 0x013B == parity_bit )
				{    
					ch 	     = 0x3B;
					scs_crg &= ~CONV_EN;				
					SC_SML_UART->CR1 |=  ( 1 << 10 );    // parity enable
					SC_SML_UART->CR1 &= ~( 1 << 9 );   // even parity 
				}
				else
				{
					ch = 0xff;  // TS error
				}
																
				scs_queue[ 1 ].qbuf[ scs_queue[ 1 ].ip ] = ch;
				scs_queue[ 1 ].ip++;
				scs_stat &= ~SC_UART_WAIT_TS;
				return ;
				
			}

			if( SC_SML_UART->SR & 1 )   // parity error
			{
				ch = ( unsigned char )SC_SML_UART->DR;					
				if( scs_crg & CRPT_EN )	//T=0;
				{
					if( repeat_chc != 0 )
					{
						repeat_chc--;							
						return;
					}
					else
					{
						scs_crg |= PARE_SB;
					}
				}
				else 	// T=1 or ATR 
				{	
					scs_crg |= PARE_SB;
				}
			}

			if( scs_crg & PARE_SB )	
			{
				scs_crg &= ~PARE_SB;
			
				if( 0 == scs_queue[ 1 ].sf )
				{
					scs_queue[ 1 ].sf = ICC_ERR_PARS;
					scs_queue[ 1 ].pf = scs_queue[ 1 ].ip;
				}
				return ;
			}	
			
			repeat_chc = 4;  	
			ch = ( unsigned char )SC_SML_UART->DR;		
			scs_queue[ 1 ].qbuf[ scs_queue[ 1 ].ip ] = scs_inverse_ch(ch);
			scs_queue[ 1 ].ip++;
			if( MAX_QBUF_SIZE == scs_queue[ 1 ].ip )
			{
				scs_queue[ 1 ].ip = 0; 
			}					
			
		}  		
    }
	
    
    if( SC_UART_SEND_EV & scs_stat )
    {					
        if( SC_SML_UART->SR & ( 1 << 6 ) )     //TC flag is set
        {       			
        	if( ( SC_SML_UART->SR & ( 1 << 5 ) ) && ( SC_SML_UART->SR & ( 1 << 1 ) ) ) //frame error, four time re-send
        	{    	
				USART1_ISR_Clr();
				if( scs_crg & CRPT_EN )
				{
	        		if( repeat_chc-- )
	        		{						
			            ch = scs_queue[ 1 ].qbuf[ scs_queue[ 1 ].op - 1 ];
			            SC_SML_UART->DR = scs_inverse_ch( ch );		
					}
					else
					{
						scs_queue[1].sf = ICC_ERR_PARS;
						scs_queue[1].pf = 0;
						scs_queue[1].ip = 1;
						scs_queue[1].op = 0;		
						USART_ITConfig( SC_SML_UART, USART_IT_TC,   DISABLE );
						USART_ITConfig( SC_SML_UART, USART_IT_RXNE, DISABLE );  	   
					}
				}
				
        	}
			else
			{		
				USART1_ISR_Clr();
				repeat_chc = 4;

				if( (int)( scs_queue[ 1 ].ip ) != (int)( scs_queue[ 1 ].op ) )
		        {
		            ch = scs_queue[ 1 ].qbuf[ scs_queue[ 1 ].op ];
		            scs_queue[ 1 ].op++;
					
		            if( MAX_QBUF_SIZE == scs_queue[ 1 ].op )
		            {
		                scs_queue[ 1 ].op = 0;
		            }    
					
					if( (int)( scs_queue[ 1 ].ip ) == (int)( scs_queue[ 1 ].op ) )
					{
						USART_SetGuardTime( SC_SML_UART, 5 ); // delay for re-sending  while frame error	
					}
										
		            SC_SML_UART->DR = scs_inverse_ch( ch );	
					
		        }
		        else
		        {          
		            scs_stat        =  SC_UART_RECV_EV;	 // send completed, convert to RX mode 
					wait_counter	=  scs_bwt; 
					work_step	    =  SC_UART_WAIT_EVENT;	
					
					USART1_ISR_Clr();	
					USART_ITConfig( SC_SML_UART, USART_IT_TC,   DISABLE );			
					USART_ITConfig( SC_SML_UART, USART_IT_RXNE, ENABLE );  
					
					USART_TOV_Timer( ENABLE, scs_etu );		
				}
			}						
        }
    }

    return;
}

/**
 * 智能卡控制器2的中断服务函数
 */
void Usart2_Isr()
{
    unsigned char ch         = 0;	
	int           parity_bit = 0;

	if( TWT_READY == twt_state ) // to start atr-wwt counter
	{
		twt_state = TWT_START;
	}	
	
	if( SC_UART_RECV_EV & scs_stat )
	{ 	    		
		if( SC_BIG_UART->SR & ( 1 << 5 ) ) //The software must wait for the RXNE flag to be set before clearing the PE bit
		{           	
			wait_counter = scs_cwt;
			work_step    = SC_UART_WAIT_EVENT;

			if( scs_stat & SC_UART_WAIT_TS ) // TS character 
			{    
				parity_bit = SC_BIG_UART->DR;	
				if( 0x0103 == parity_bit )
				{         
					ch        =  0x3F;
					scs_crg  |=  CONV_EN;					
					SC_BIG_UART->CR1 |= 1 << 10;    // parity enable
					SC_BIG_UART->CR1 |= 1 << 9;    //odd parity
				}
				else if( 0x013B == parity_bit )
				{    
					ch 	      = 0x3B;
					scs_crg  &= ~CONV_EN;				
					SC_BIG_UART->CR1 |= 1 << 10;    // parity enable
					SC_BIG_UART->CR1 &= ~( 1 << 9 );   // even parity 
				}
				else
				{
					ch = 0xff;  // TS error
				}
																
				scs_queue[ 0 ].qbuf[ scs_queue[ 0 ].ip ] = ch;
				scs_queue[ 0 ].ip++;
				scs_stat &= ~SC_UART_WAIT_TS;
				return ;
				
