wlbxcj/STM32P10/3911版/src/driver/smartcard/emv_hard.c
			}

			if( SC_BIG_UART->SR & 1 )   // parity error
			{
				ch = ( unsigned char )SC_BIG_UART->DR;					
				if(scs_crg & CRPT_EN)	//T=0;
				{
					if( repeat_chc != 0 )
					{
						repeat_chc--;	
						
						//dbg_msg( 1, "recv pars!\r\n" );
												
						return;
					}
					else
					{
						scs_crg |= PARE_SB;
					}
				}
				else 	// T=1 or ATR 
				{	
					scs_crg |= PARE_SB;
				}
			}

			if( scs_crg & PARE_SB )	
			{
				scs_crg &= ~PARE_SB;
				
                if( 0 == scs_queue[ 0 ].sf )
				{
					scs_queue[ 0 ].sf = ICC_ERR_PARS;
					scs_queue[ 0 ].pf = scs_queue[ 0 ].ip;
				}
				
				if( 0 == scs_dev->terminal_ptype )
				{        		
					emv_hard_power_dump( ( struct emv_core* )scs_dev ); //power down
				}
				return ;
			}	
			
			repeat_chc = 4;  	
			ch = ( unsigned char )SC_BIG_UART->DR;		
			scs_queue[ 0 ].qbuf[ scs_queue[ 0 ].ip ] = scs_inverse_ch(ch);
			scs_queue[ 0 ].ip++;

			if( MAX_QBUF_SIZE == scs_queue[ 0 ].ip )
			{
				scs_queue[ 0 ].ip = 0; 
			}					
		}  		
    }
	
    
    if( SC_UART_SEND_EV & scs_stat )
    {					
        if( SC_BIG_UART->SR & ( 1 << 6 ) )     //TC flag is set
        {       			
        	if((SC_BIG_UART->SR & ( 1 << 5 ) ) && ( SC_BIG_UART->SR & 2 )) //frame error, four time re-send
        	{    	
				USART2_ISR_Clr();
				if( scs_crg & CRPT_EN )
				{
	        		if( repeat_chc-- )
	        		{						
			            ch = scs_queue[ 0 ].qbuf[ scs_queue[ 0 ].op - 1 ];
			            SC_BIG_UART->DR = scs_inverse_ch( ch );		
					}
					else
					{
						scs_queue[0].sf = ICC_ERR_PARS;
						scs_queue[0].pf = 0;
						scs_queue[0].ip = 1;
						scs_queue[0].op = 0;		
						USART_ITConfig( SC_BIG_UART, USART_IT_TC,   DISABLE );
						USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, DISABLE );  	
						emv_hard_power_dump( ( struct emv_core* )scs_dev ); //power down	
						
						//dbg_msg( 1, "send pars!\r\n" );
						  
					}
				}
				
        	}
			else
			{		
				USART2_ISR_Clr();
				repeat_chc = 4;

				if( (int)(scs_queue[ 0 ].ip) != (int)(scs_queue[ 0 ].op) )
		        {
		            ch = scs_queue[ 0 ].qbuf[ scs_queue[ 0 ].op ];
		            scs_queue[ 0 ].op++;
					
		            if( MAX_QBUF_SIZE == scs_queue[ 0 ].op )
		            {
		                scs_queue[ 0 ].op = 0;
		            }    
					
					if( (int)(scs_queue[ 0 ].ip) == (int)(scs_queue[ 0 ].op) )
					{
						USART_SetGuardTime( SC_BIG_UART, 5 ); // delay for re-sending  while frame error	
					}
		            SC_BIG_UART->DR = scs_inverse_ch( ch );	
		        }
		        else
		        {          
		            scs_stat     =  SC_UART_RECV_EV;	 // send completed, convert to RX mode 
					wait_counter =  scs_bwt; 
					work_step	 =  SC_UART_WAIT_EVENT;		
					USART2_ISR_Clr();
					USART_ITConfig( SC_BIG_UART, USART_IT_TC,   DISABLE );			
					USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, ENABLE );  
					USART_TOV_Timer( 1, scs_etu );		
				}
			}						
        }
    }

    return;
}

/**
 * 超时定时器配置
 */
static int USART_TOV_Timer( int enable, int etu )
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    
    TIM_Cmd( TIM5, DISABLE );
    TIM_TimeBaseStructure.TIM_Period        = etu - 1;      
    TIM_TimeBaseStructure.TIM_Prescaler     = 0x13;       
    TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;    
    TIM_TimeBaseStructure.TIM_CounterMode   = TIM_CounterMode_Up; 
    TIM_TimeBaseInit( TIM5, &TIM_TimeBaseStructure );
    
    TIM_ITConfig( TIM5, TIM_IT_Update, ENABLE );
    TIM_ClearITPendingBit( TIM5, TIM_IT_Update );
    if( enable )
    {
    	TIM_Cmd( TIM5, ENABLE );
    }
    
    return 0;	
}

/**
 * 超时定时器中断服务函数
 */
void Timer5_Isr()
{	
	TIM5->SR = 0;
	
	switch( work_step )
    {
   		case SC_UART_CLKS_EVENT:
   		{
	        wait_counter--;
	        if( 0 == wait_counter )
	        {
	        	emv_hard_reset_signal( scs_dev->terminal_ch, 0 );
	        	wait_counter  =  scs_rwt;
	        	work_step     =  SC_UART_RSTH_EVENT;
	        	emv_hard_clock_enable( scs_dev->terminal_ch, 1 );
	       	}
	 	}
	 	break;
    
		case SC_UART_RSTL_EVENT:
		{
		    wait_counter--;
		    if( 0 == wait_counter )
		    {
		        emv_hard_reset_signal( scs_dev->terminal_ch, 0 );
		        wait_counter =   scs_rwt;
		        work_step    =   SC_UART_RSTH_EVENT;
		    }
		}
		break;
    
		case SC_UART_RSTH_EVENT:
		{
		    wait_counter--;
		    if( 0 == wait_counter )
		    {	
		    	scs_dev->queue->ip = 0;
		    	scs_dev->queue->op = 0;
		    	scs_dev->queue->sf = 0;
		    	scs_dev->queue->pf = INVALID_INDEX;
		    	wait_counter = scs_bwt;
			    work_step = SC_UART_WAIT_EVENT;	
			
			    emv_hard_reset_signal( scs_dev->terminal_ch, 1 );	
                
                if( USC == scs_dev->terminal_ch )
                {
                    USART2_ISR_Clr();			
			        USART_ITConfig( SC_BIG_UART, USART_IT_TC, DISABLE );		
			        USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, ENABLE );
                }
                else
                {
                    USART1_ISR_Clr();			
			        USART_ITConfig( SC_SML_UART, USART_IT_TC, DISABLE );		
			        USART_ITConfig( SC_SML_UART, USART_IT_RXNE, ENABLE );   
                }
			    USART_TOV_Timer( 1, scs_etu );	
		  }
		}
		break;
    	
	    case SC_UART_WAIT_EVENT:
	    {
	        wait_counter--;
	        if( 0 == wait_counter )
	        {   				
	            if( (int)( scs_dev->queue->ip ) == (int)( scs_dev->queue->op ) )/* WWT or BWT or TS */
	            {
	                scs_dev->queue->sf = ICC_ERR_BWT;					
	            }
	            else
	            {
	                scs_dev->queue->sf = ICC_ERR_CWT;
	            }
	            scs_dev->queue->pf = (int)scs_dev->queue->ip;
	            work_step = 0;	
	            
	            if( USC == scs_dev->terminal_ch )
                {		
				    USART_ITConfig( SC_BIG_UART, USART_IT_TC, DISABLE );
				    USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, DISABLE );
				}
				else
				{
				    USART_ITConfig( SC_SML_UART, USART_IT_TC, DISABLE);
				    USART_ITConfig( SC_SML_UART, USART_IT_RXNE, DISABLE);  
				}
				USART_TOV_Timer( 0, 0 ); 	
	        }
	    }
	   	break;

		case SC_UART_IGDT_EVENT: /*通用定时器*/
		{
			wait_counter--;
			if( 0 == wait_counter )
			{
				USART_TOV_Timer( 0, 0 );
				work_step = 0;
			}
		}
		break;
		
		default:
		break;
	}

	if( TWT_START == twt_state )
    {
        twt_wait_counter --;   
        if( 0 == twt_wait_counter )
        {
            scs_dev->queue->sf = ICC_ERR_CWT;
            scs_dev->queue->pf = scs_dev->queue->ip;
            work_step    = 0;
            	
            if( USC == scs_dev->terminal_ch )
            {
			    USART_ITConfig( SC_BIG_UART, USART_IT_TC, DISABLE );
			    USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, DISABLE );
			}
			else
			{
			    USART_ITConfig( SC_SML_UART, USART_IT_TC, DISABLE );
			    USART_ITConfig( SC_SML_UART, USART_IT_RXNE, DISABLE );   
			}
			USART_TOV_Timer( 0, 0 );
        }  
    }
	TIM5->SR = 0;
	
    return;
}

/**
 * ============================ 硬件初始化 ================================
 */
int  emv_hard_init( void )
{
	GPIO_InitTypeDef GPIO_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
    
    /*初始化SAM卡共用电源、时钟标志信号*/
    sam_vcc_used_flag  = 0;
    sam_clk_used_flag  = 0;    
    sam_slot_last_flag = 0;

	/*配置所用到的外设时钟*/
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA, ENABLE );
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB, ENABLE );
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOE, ENABLE );
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOF, ENABLE );
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_AFIO, ENABLE );
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_USART1, ENABLE );
	
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM5, ENABLE );
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_USART2, ENABLE );
	
    /*配置定时器中断系统*/
    NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQChannel;
  	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
  	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  	NVIC_Init(&NVIC_InitStructure);
    
	/*智能卡的用户卡在位检测中断使用系统定时器扫描方式*/
	;
	
	/*配置用户卡信号线*/
	GPIO_InitStructure.GPIO_Pin   = ICC_VCC_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( ICC_GPIO_PORT_2, &GPIO_InitStructure );
	GPIO_SetBits( ICC_GPIO_PORT_2, ICC_VCC_PIN );

	GPIO_InitStructure.GPIO_Pin   = ICC_RST_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( ICC_GPIO_PORT_2, &GPIO_InitStructure );
	GPIO_ResetBits( ICC_GPIO_PORT_2, ICC_RST_PIN );
    
    /*用户卡片在位检测信号,必须拔出Jtag否则一直为低电平*/
    //AFIO->MAPR &= ~( 7 << 24 );
    //AFIO->MAPR |=  ( 1 << 26 );
    
    GPIO_InitStructure.GPIO_Pin   = ICC_DET_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( ICC_GPIO_PORT_1, &GPIO_InitStructure );
	GPIO_SetBits( ICC_GPIO_PORT_1, ICC_DET_PIN );
    
