wlbxcj/STM32P10/3911版/src/driver/smartcard/emv_hard.c
	/*配置SAM卡信号*/
	GPIO_InitStructure.GPIO_Pin   = SAM_VCC_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( SAM_GPIO_PORT_1, &GPIO_InitStructure );
	GPIO_SetBits( SAM_GPIO_PORT_1, SAM_VCC_PIN );

	GPIO_InitStructure.GPIO_Pin   = SAM_RST_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( SAM_GPIO_PORT_1, &GPIO_InitStructure );
	GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_RST_PIN );

    /*配置SAM卡片选信号*/
    GPIO_InitStructure.GPIO_Pin   = SAM_CSL_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( SAM_GPIO_PORT_2, &GPIO_InitStructure );
	GPIO_ResetBits( SAM_GPIO_PORT_2, SAM_CSL_PIN );

    GPIO_InitStructure.GPIO_Pin   = SAM_CSH_PIN;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init( SAM_GPIO_PORT_2, &GPIO_InitStructure );
	GPIO_ResetBits( SAM_GPIO_PORT_2, SAM_CSH_PIN );
    
    USART1_Config();
    USART2_Config();
    
    Set_IRQProcessFunc( USART1_IRQChannel, Usart1_Isr );
    Set_IRQProcessFunc( USART2_IRQChannel, Usart2_Isr );
    Set_IRQProcessFunc( TIM5_IRQChannel, Timer5_Isr );
    
	return 0;
}

/*卸载软、硬件资源*/
int  emv_hard_release( void )
{
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM5, DISABLE );
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_USART2, DISABLE );
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_USART1, DISABLE );
    
    Reset_IRQProcessFunc( USART1_IRQChannel );
    Reset_IRQProcessFunc( USART2_IRQChannel );
    Reset_IRQProcessFunc( TIM5_IRQChannel );
    
    return 0;
}

/**
 * 对于反向发送情况进行数据处理
 */
static unsigned char scs_inverse_ch( unsigned char ch )
{
    int           i   = 0;
    unsigned char ich = 0;
    
    if( scs_crg & CONV_EN )
    {
        ich = ch ^ 0xFF;
        ch  = 0;
        for( i = 0; i < 8; i++ )
            if( ( ich & ( 1 << i ) ) )ch |= 1 << ( 7 - i );
    }
    
    return ch;
}

/**
 * 检查通道号的合法性
 */
int isvalid_channel( int slot )
{
    slot &= 0x07;

	if(  ( 0 != slot ) 
	   &&( 1 != slot )
	   &&( 2 != slot )
	   &&( 3 != slot )
	   &&( 4 != slot ) 
	  )return 0;
	
	return 1;
}

/**
 * 切换通道号
 */
int select_slot( int slot )
{
    int channel = slot & 0x07;
    
    /*SAM卡硬件切换, 用户卡不用切换*/
    if( USC != channel )
    {
        if( channel == sam_slot_last_flag )return channel;
        
        switch( channel )
        {
        case SAM1:
            GPIO_ResetBits( SAM_GPIO_PORT_2, SAM_CSL_PIN );
            GPIO_ResetBits( SAM_GPIO_PORT_2, SAM_CSH_PIN );
        break;
        case SAM2:
            GPIO_SetBits( SAM_GPIO_PORT_2, SAM_CSL_PIN );
            GPIO_ResetBits( SAM_GPIO_PORT_2, SAM_CSH_PIN );
        break;
        case SAM3:
            GPIO_ResetBits( SAM_GPIO_PORT_2, SAM_CSL_PIN );
            GPIO_SetBits( SAM_GPIO_PORT_2, SAM_CSH_PIN );
        break;
        case SAM4:
            GPIO_SetBits( SAM_GPIO_PORT_2, SAM_CSL_PIN );
            GPIO_SetBits( SAM_GPIO_PORT_2, SAM_CSH_PIN );
        break;
        default:
        break;
        }
        sam_slot_last_flag = channel;
    }

    return channel;
}

/**
 * 电源控制
 */
static int emv_hard_power_signal( int channel, int vcc )
{
    if( USC == channel )
    {
        switch( vcc )
        {
        case 0:
		    GPIO_SetBits( ICC_GPIO_PORT_2, ICC_VCC_PIN );
	    break;
//        case 1800:
//        break;
//        case 3000:
//        break;
//        case 5000:
//        break;
        default:
		    GPIO_ResetBits( ICC_GPIO_PORT_2, ICC_VCC_PIN );
        break;
        }
    }
    else
    {
    	if( vcc )
    	{
    	    if( !sam_vcc_used_flag )
            {
                USART1_Config();/*调试串口与SAM共用USART1配置*/
                GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_VCC_PIN );/*电源未开则打开*/
    	    }
            sam_vcc_used_flag |=  1 << channel;
    	}
    	else 
    	{
    	    /*没有其他通道占用*/
    	    if( !( sam_vcc_used_flag & ( ~( 1 << channel ) ) ) )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_VCC_PIN );/*关闭电源*/
            sam_vcc_used_flag &= ~( 1 << channel );
        }
    }
	
	return 0;
}

/**
 * 异步卡时钟控制
 */
static int emv_hard_clock_enable( int channel, int enable )
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
    if( USC == channel )
    {
		if( enable )
		{
		    SC_BIG_UART->CR2 |= 1 << 11;
		    
			GPIO_InitStructure.GPIO_Pin   = ICC_CLK_PIN; 
			GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
			GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
			GPIO_Init( ICC_GPIO_PORT_1, &GPIO_InitStructure );
		}
		else
		{
		   SC_BIG_UART->CR2 &= ~( 1 << 11 );
		   ICC_GPIO_PORT_1->ODR  &= ~ICC_CLK_PIN;
		   
		   GPIO_InitStructure.GPIO_Pin   = ICC_CLK_PIN;
		   GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
		   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
		   GPIO_Init( ICC_GPIO_PORT_1, &GPIO_InitStructure ); 
	    }
    }
    else
    {
    	if( enable )
		{
		    //dbg_msg( 1, "CLK-EN(%d) = %X\r\n", channel, sam_clk_used_flag );
		    if( !sam_clk_used_flag )
		    {
		        SC_SML_UART->CR2 |= 1 << 11;
		    
			    GPIO_InitStructure.GPIO_Pin   = SAM_CLK_PIN; 
			    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
			    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
			    GPIO_Init( SAM_GPIO_PORT_1, &GPIO_InitStructure );
		    }
		    sam_clk_used_flag |= 1 << channel;
		}
		else
		{
		    //dbg_msg( 1, "CLK-DIS(%d) = %X\r\n", channel, sam_clk_used_flag );
		    if( !( sam_clk_used_flag & ( ~( 1 << channel ) ) ) )
		    {
		        SC_SML_UART->CR2 &= ~( 1 << 11 );
		        SAM_GPIO_PORT_1->ODR  &= ~SAM_CLK_PIN;
		   
		        GPIO_InitStructure.GPIO_Pin   = SAM_CLK_PIN;
		        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
		        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	            GPIO_Init( SAM_GPIO_PORT_1, &GPIO_InitStructure ); 
	        }
	        sam_clk_used_flag &= ~( 1 << channel );
	    }
	}
    
    return 0;
	
}

/**
 * 复位信号控制
 */
static int emv_hard_reset_signal( int channel, int level )
{
    switch( channel )
    {
    case USC:
        if( level )GPIO_SetBits( ICC_GPIO_PORT_2, ICC_RST_PIN ); /*RST High*/
        else GPIO_ResetBits( ICC_GPIO_PORT_2, ICC_RST_PIN ); /*RST Low*/
    break;
    case SAM1:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST High*/
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST Low*/
    break;
    case SAM2:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST High*/
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST Low*/
    break;
    case SAM3:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST High*/
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST Low*/
    break;
    case SAM4:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST High*/
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_RST_PIN ); /*RST Low*/
    break;
    default:
    break;
    }

    
