wlbxcj/STM32P10/3911版/src/driver/smartcard/emv_hard.c
	return 0;
}

/*数据信号控制*/
static int emv_hard_io_signal( int channel, int level )
{
    GPIO_InitTypeDef GPIO_InitStructure;
    
    switch( channel )
    {
    case USC:
        GPIO_InitStructure.GPIO_Pin   = ICC_IO_PIN;
	    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_OD;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	    GPIO_Init( ICC_GPIO_PORT_1, &GPIO_InitStructure );
	    
        if( level )GPIO_SetBits( ICC_GPIO_PORT_1, ICC_IO_PIN );
        else GPIO_ResetBits( ICC_GPIO_PORT_1, ICC_IO_PIN );
        
    break;
    case SAM1:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
    break;
    case SAM2:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
    break;
    case SAM3:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
    break;
    case SAM4:
    	if( level )GPIO_SetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
        else GPIO_ResetBits( SAM_GPIO_PORT_1, SAM_IO_PIN );
    break;
    default:
    break;
    }
    
    return 0;   
}

/**
 * 干扰中断控制
 */
int emv_disturb_interruption( struct emv_core *pdev, int enable )
{
    return 0;
}

/**
 * 智能卡软件工作参数配置
 */
int emv_hard_config( struct emv_core *pdev )
{    
    USART_TOV_Timer( 0, 0 );
    
    scs_dev  = pdev;
    if( USC == pdev->terminal_ch )/*用户卡配置*/
    {	
		USART_ITConfig( SC_BIG_UART, USART_IT_TC, DISABLE );
		USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, DISABLE );
		USART2_ISR_Clr();
		
        emv_core_init( pdev, ( struct emv_queue* )&( scs_queue[ 0 ] ) );
        pdev->queue->pf = INVALID_INDEX;
        pdev->queue->sf = 0;
        
        if( pdev->terminal_conv )scs_crg |= CONV_EN;
        else scs_crg &= ~CONV_EN;
        
		if( 0 == pdev->terminal_ptype )/*T=0*/
		{
			if( 1 == ( pdev->queue->ip - pdev->queue->op ) )
			{		
				USART_SetGuardTime( SC_BIG_UART, 5 );
			}
			else
			{	
				if( pdev->terminal_cgt >15 )USART_SetGuardTime( SC_BIG_UART, pdev->terminal_cgt - 11 );
				else USART_SetGuardTime( SC_BIG_UART, pdev->terminal_cgt - 11 + 5 );
			}			
		}
		else
		{
			USART_SetGuardTime( SC_BIG_UART, pdev->terminal_cgt - 11 );
		}
		
		USART_SmartCardSetBrr( FCLK_CARD / ( pdev->terminal_fi / pdev->terminal_di ) );
		
        scs_rwt  =  pdev->terminal_di * 113;
        scs_etu  =  pdev->terminal_fi / pdev->terminal_di;
		scs_cgt  =  pdev->terminal_cgt;

		if( 1 == pdev->terminal_ptype )/*T=1*/
		{
			scs_bwt  = pdev->terminal_bwt;
			scs_cwt  = pdev->terminal_cwt;			
			scs_crg &= ~CRPT_EN;
			SC_BIG_UART->CR2 &= ~(3<<12);
			SC_BIG_UART->CR2 |=  (1<<12);
		}
		else
		{
			scs_cwt  = pdev->terminal_wwt;			
			scs_bwt  = scs_cwt;	
			scs_crg  |= CRPT_EN;		
			SC_BIG_UART->CR2 &= ~(3<<12);
			SC_BIG_UART->CR2 |=  (3<<12);
		}

		repeat_chc = 4;			
    }
    else/*SAM卡配置*/
    {
		USART_ITConfig( SC_SML_UART, USART_IT_TC, DISABLE );
		USART_ITConfig( SC_SML_UART, USART_IT_RXNE, DISABLE );
		USART1_ISR_Clr();
		
        emv_core_init( pdev, ( struct emv_queue* )&( scs_queue[ 1 ] ) );
        pdev->queue->pf = INVALID_INDEX;
        pdev->queue->sf = 0;
        
        if( pdev->terminal_conv )scs_crg |= CONV_EN;
        else scs_crg &= ~CONV_EN;
        
		if( 0 == pdev->terminal_ptype )
		{
			if( 1 == ( pdev->queue->ip - pdev->queue->op ) )
			{		
				USART_SetGuardTime( SC_SML_UART, 5 );
			}
			else
			{	
				if( pdev->terminal_cgt > 15 )USART_SetGuardTime( SC_SML_UART, pdev->terminal_cgt - 11 );
				else USART_SetGuardTime( SC_SML_UART, pdev->terminal_cgt - 11 + 5 );
			}			
		}
		else
		{
			USART_SetGuardTime( SC_SML_UART, pdev->terminal_cgt - 11 );
		}
		
		USART_SmartCardSetBrr( FCLK_CARD / ( pdev->terminal_fi / pdev->terminal_di ) );
		
        scs_rwt  =  pdev->terminal_di * 113;
        scs_etu  =  pdev->terminal_fi / pdev->terminal_di;
		scs_cgt  =  pdev->terminal_cgt;

		if( 1 == pdev->terminal_ptype )
		{
			scs_bwt  = pdev->terminal_bwt;
			scs_cwt  = pdev->terminal_cwt;			
			scs_crg &= ~CRPT_EN;
			SC_SML_UART->CR2 &= ~(3<<12);
			SC_SML_UART->CR2 |=  (1<<12);
		}
		else
		{
			scs_cwt  = pdev->terminal_wwt;			
			scs_bwt  = scs_cwt;	
			scs_crg  |= CRPT_EN;		
			SC_SML_UART->CR2 &= ~(3<<12);
			SC_SML_UART->CR2 |=  (3<<12);
		}
		 
		repeat_chc = 4;	
    }
    
    return 0;
}

/**
 * 卡片在位检测函数
 */
int emv_hard_detect( struct emv_core *pdev )
{    
    unsigned char det_status;
        
    if( USC == pdev->terminal_ch )
    {  
        det_status = GPIO_ReadInputDataBit( ICC_GPIO_PORT_1, ICC_DET_PIN );
        //dbg_msg( 1, "Detect PIN : %02X\r\n", det_status );
        if( 0 == det_status )return 1;
    }
	else /*目前没有使用*/
	{
		return 1;
	}
	
    return 0;
}

/**
 * 使能通道电源
 */
int emv_hard_power_pump( struct emv_core *pdev )
{
    emv_hard_config( pdev );
    emv_queue_flush( pdev );
	
	emv_hard_power_signal( pdev->terminal_ch, pdev->terminal_vcc );
	
	work_step = SC_UART_IGDT_EVENT;
	wait_counter = 100;
	USART_TOV_Timer( 1, scs_etu );
	while( SC_UART_IGDT_EVENT == work_step );

    return 0;
}

/**
 * 关闭通道电源
 */
int emv_hard_power_dump( struct emv_core *pdev )
{	
    volatile int i;
    
    if( USC != pdev->terminal_ch )
    {
      emv_hard_clock_enable( pdev->terminal_ch, 0 );
      for( i = 0; i < 720; i++ );
    }
    else
    {
        emv_hard_reset_signal( pdev->terminal_ch, 0 );
        for( i = 0; i < 720; i++ );
        
        emv_hard_io_signal( pdev->terminal_ch, 0 );
        for( i = 0; i < 720; i++ );
        
        emv_hard_clock_enable( pdev->terminal_ch, 0 );
        for( i = 0; i < 720; i++ );
    }
    emv_hard_power_signal( pdev->terminal_ch, 0 );
    pdev->terminal_state = EMV_IDLE;
    pdev->terminal_open  = 0;
    for( i = 0; i < 7200; i++ );

    return 0;
}

/**
 * 通道冷复位
 */
int emv_hard_cold_reset( struct emv_core *pdev )
{
    pdev->terminal_state = EMV_COLD_RESET;
    pdev->terminal_fi = pdev->terminal_implict_fi;
    pdev->terminal_di = pdev->terminal_implict_di;
    pdev->terminal_conv  = 0;
    
    if( USC == pdev->terminal_ch )USART2_Config();
    emv_hard_config( pdev );
    scs_crg &= ~CRPT_EN;

    if( 0 == pdev->terminal_spec )/*EMV规范*/
    {
        scs_bwt = 121 * pdev->terminal_di;
    }
    else /*ISO7816-3规范*/
    {
        scs_bwt = ( 121 + 15 )* pdev->terminal_di;
    }

    scs_cwt = 10096 * pdev->terminal_di;
    scs_cgt = 12;
	
    if( 0 == pdev->terminal_spec )
    {
        twt_wait_counter = 20176 * pdev->terminal_di;
        twt_state = TWT_READY;
    }
    else
    {
        twt_state = TWT_STOP;
    }

    scs_stat         =   SC_UART_WAIT_TS | SC_UART_RECV_EV;         	    	
    work_step        =   SC_UART_CLKS_EVENT;                       
    wait_counter     =   5 * pdev->terminal_di;

    emv_hard_clock_enable( pdev->terminal_ch, 0 );	
    USART_TOV_Timer( 1, scs_etu );  
    
