wlbxcj/STM32P10/3911版/src/driver/smartcard/emv_hard.c
    return 0;
}

/**
 * 通道热复位
 */
int emv_hard_warm_reset( struct emv_core *pdev )
{
    pdev->terminal_state = EMV_WARM_RESET;
    pdev->terminal_fi    = pdev->terminal_implict_fi; // restor default parameters 
    pdev->terminal_di    = pdev->terminal_implict_di;
    pdev->terminal_conv  = 0;
	
    emv_hard_config( pdev );
	scs_crg &= ~CRPT_EN;
	
	if( 0 == pdev->terminal_spec )/* ShangHai 2010-8-27 RuanYu */
    {
        scs_bwt = 121 * pdev->terminal_di;
    }
    else
    {
        scs_bwt = ( 121 + 15 )* pdev->terminal_di;
    }
	
    scs_cwt = 10096 * pdev->terminal_di;
	scs_cgt = 12;
	
	if( 0 == pdev->terminal_spec )
    {
        twt_wait_counter = 20176 * pdev->terminal_di;
        twt_state = TWT_READY;
    }
    else
    {
        twt_state = TWT_STOP;
    }
	
    scs_stat     =  SC_UART_WAIT_TS | SC_UART_RECV_EV;
    work_step    =  SC_UART_RSTL_EVENT;
    wait_counter =  5 * pdev->terminal_di;
    USART_TOV_Timer( 1, scs_etu );

    return 0;
}

/**
 * 智能卡数据通信
 */
int emv_hard_xmit( struct emv_core *pdev )
{	
	unsigned char ch;
	
    twt_state    = TWT_STOP; 
	
	if( USC == pdev->terminal_ch )USART2_ISR_Clr();
	else USART1_ISR_Clr();
	
	/*反向保护时间*/
	work_step = SC_UART_IGDT_EVENT;
	wait_counter = 64 * scs_dev->terminal_di;
	USART_TOV_Timer( 1, scs_etu );
	while( SC_UART_IGDT_EVENT == work_step );
	
	/*通信配置*/
    emv_hard_config( pdev );
    
	scs_stat = SC_UART_SEND_EV;
    ch = pdev->queue->qbuf[ pdev->queue->op++ ];
    
    if( USC == pdev->terminal_ch )
    {
    	if( CRPT_EN & scs_crg )USART_SmartCardNACKCmd( SC_BIG_UART, ENABLE ); // Enable the NACK Transmission */
		else USART_SmartCardNACKCmd( SC_BIG_UART, DISABLE ); // Enable the NACK Transmission */ 
		
        SC_BIG_UART->DR   = scs_inverse_ch( ch );	
		
		USART_ITConfig( SC_BIG_UART, USART_IT_RXNE, DISABLE );
		USART_ITConfig( SC_BIG_UART, USART_IT_TC, ENABLE );
    }
    else
    {
    	if( CRPT_EN & scs_crg )USART_SmartCardNACKCmd( SC_SML_UART, ENABLE ); // Enable the NACK Transmission */
		else USART_SmartCardNACKCmd( SC_SML_UART, DISABLE ); // Enable the NACK Transmission */ 
		
        SC_SML_UART->DR   = scs_inverse_ch( ch );	
		
		USART_ITConfig( SC_SML_UART, USART_IT_RXNE, DISABLE );
		USART_ITConfig( SC_SML_UART, USART_IT_TC, ENABLE );	
    }
    
    /*等待发送完成*/
	if( MAX_QBUF_SIZE == pdev->queue->op )pdev->queue->op = 0;
    while( scs_stat & SC_UART_SEND_EV )if( pdev->queue->sf )break;
    
    return 0;
}
#endif